** progn

The progn construct allows you to group a series of expressions. All expressions
are evaluated, but only the result of the last expression is returned.

#+begin_src emacs-lisp
  (progn
    (print "This is the first statement")
    (print "This is the second statement")
    ;; the last expression's value is returned
    (+ 2 3))
#+end_src

#+RESULTS:
: 5


** let
The let form uses nested lists, but because it's a special form, only certain
elements get evaluated.

In general, LET looks like this:
*(let (bindings) forms)*

where bindings is any number of two-element lists -- each list containing a
symbol and a value -- and forms is any number of Lisp forms. The forms are
evaluated, in order, using the values established by the bindings. LET returns
the value(s) returned by the last form.

Indentation doesn't affect the operation of LET, but proper indentation does
improve readability.

#+begin_src emacs-lisp
(let ((a 3)
(b 4)
(c 5))
(* (+ a b) c))
#+end_src

#+RESULTS:
: 35
a
Error: Unbound variable
b
Error: Unbound variable
c
Error: Unbound variable

The above LET form defines values for the symbols A, B, and C, then uses these
as variables in an arithmetic calculation. The calculation's result is also the
result of the LET form.

NOTE THAT NONE OF THE VARIABLES DEFINED IN THE LET HAVE A VALUE AFTER LISP HAS
FINISHED EVALUATING THE FORM.


If you define a variable using SETQ and then name the same variable in a LET
form, the value defined by LET supersedes the other value during evaluation of
the LET:

#+begin_src emacs-lisp
(setq a 89)
#+end_src

#+RESULTS:
: 89

#+begin_src emacs-lisp
(let ((a 3))
(+ a 2))
#+end_src

#+RESULTS:
: 5

#+begin_src emacs-lisp
a
#+end_src

#+RESULTS:
: 89

Unlike SETQ, which assigns values in left-to-right order, LET binds variables
all at the same time:

#+begin_src emacs-lisp
(setq w 77)
#+end_src

#+RESULTS:
: 77

#+begin_src emacs-lisp
(let ((w 8)
(x w))
(+ w x))
#+end_src

#+RESULTS:
: 85

LET bound W to 8 and X to W. Because these bindings happened at the same time, W
still had its value of 77.
Lisp has a variation of LET, called LET*, that does perform bindings in order:
(setq u 37)
37
#+begin_src emacs-lisp
(let* ((v 4)
(u v))
(+ u v))
#+end_src


The let construct is used for binding variables. It also acts like a block
because all expressions inside the let are evaluated in sequence.


#+begin_src emacs-lisp
(let ((x 5)
      (y 3))
  (print (+ x y))  ; Prints 8
  (* x y))         ; Returns 15
#+end_src

#+RESULTS:
: 15

** dolist

The dolist macro iterates over each element of a list, executing a block of code
for each element.

#+BEGIN_SRC emacs-lisp 
(with-output-to-string
  (dolist (number '(1 2 3 4))
    (princ (format "%d\n" (* number 2)))))
#+END_SRC

#+RESULTS:
: 2
: 4
: 6
: 8

** dotimes

The dotimes macro is a looping construct that iterates a specified number of
times.
#+BEGIN_SRC emacs-lisp 
(with-output-to-string
  (dotimes (i 4)
    (princ (format "Iteration %d\n" i))))
#+END_SRC

#+RESULTS:
: Iteration 0
: Iteration 1
: Iteration 2
: Iteration 3

** cond

The cond construct provides a way to execute different blocks of code based on
conditions, similar to if-else statements in other languages.


#+begin_src emacs-lisp
(cond
  ((> 3 2)
   (print "3 is greater than 2"))
  (t
   (print "This won't be printed")))
#+end_src

#+RESULTS:
: 3 is greater than 2


These examples illustrate how Lisp uses different constructs to achieve
something similar to statement blocks in other languages. Each construct serves
a specific purpose, whether it's for looping, conditional execution, or just
grouping expressions together.

* defvar and defparameter
Initialization Behavior:
defvar: Does not change the variable's value if it already exists.
defparameter: Always sets the variable to the given value.

    Use Cases: Use defvar when you want to declare a global variable that should
        retain its value once set, even across multiple evaluations of the
        defvar form. This is useful for variables where a default value is
        sufficient unless explicitly changed. Use defparameter for variables
        that you expect to reinitialize regularly. This is often used for
        configuration variables that might change as the program runs or as part
        of the program's initialization process.

Example in Context

;; Using defvar
#+begin_src emacs-lisp
  (defvar *my-var* 10) 
  (princ *my-var*)
#+end_src

#+RESULTS:
: 10

;; Re-evaluating with a different value
#+begin_src emacs-lisp
  (defvar *my-var* 20)
  (princ *my-var*)
#+end_src

#+RESULTS:
: 10

;; Using defparameter
#+begin_src emacs-lisp
  (defparameter *my-param* 30)
  (princ *my-param*)
#+end_src

;; Re-evaluating with a different value
#+begin_src emacs-lisp
  (defparameter *my-param* 40) 
  (princ *my-param*)
#+end_src

In summary, the choice between defvar and defparameter depends on whether you
want the variable's value to be updated on subsequent re-evaluations of the
declaration.

** setq
setq is used for directly assigning a value to the variable named by the
first argument, without evaluating the first argument.

The difference between (setq x 10) and (setq x '10) in Lisp boils down to the
nature of the value being assigned to the symbol x. Let's explore each case:

#+begin_src emacs-lisp
(setq x 10)
#+end_src

#+RESULTS:
: 10

In this expression, the number 10 is assigned to the variable x.
10 here is an integer, a numeric value.
After this expression, if you evaluate x, it will return the number 10.

#+begin_src emacs-lisp
 (setq x '10)
#+end_src

#+RESULTS:
: 10

In this expression, '10 is a quoted expression. The quote ' in Lisp indicates
that what follows should be treated as a literal symbol or list, not evaluated.
So, '10 is actually the symbol 10, not the numeric value 10. After this
expression, if you evaluate x, it will return the symbol 10, not the number 10.
This might be a bit confusing because 10 looks like a number, but in the context
of '10, it is a symbol.

In summary:

    (setq x 10) sets x to the numeric value 10.
    (setq x '10) sets x to the symbol 10.

The key difference is between using a number as a direct value and using a
quoted expression that represents a symbol. In Lisp, quoting a number like '10
turns it into a symbol instead of a numeric value.

** set
set evaluates its first argument, which allows it to dynamically choose which
variable to assign the second argument's value to, based on the result of that
evaluation.

;;sets var1 to the symbol 'var2'
#+begin_src emacs-lisp
 (setq var1 'var2) 
#+end_src

#+RESULTS:
: var2
#+begin_src emacs-lisp
 (set var1 20) 
#+end_src

#+RESULTS:
: 20

#+begin_src emacs-lisp
 (princ var1)
#+end_src

#+RESULTS:
: var2

#+begin_src lisp
 (princ var2)
 #+end_src

 #+RESULTS:
 : 20


In summary:
  - setq is used for directly assigning a value to the variable named by the
  first argument, without evaluating the first argument.

  - set evaluates its first argument, which allows it to dynamically choose which
  variable to assign the second argument's value to, based on the result of that
  evaluation.

** Anonymous Functions

Application with funcall:
    *funcall* is used to call functions indirectly, especially useful for lambda
    functions or when the function to call is determined at runtime. 


#+begin_src emacs-lisp
  (funcall #'fib 30)
#+end_src

#+RESULTS:
: 832040

This calls fib with 30, where *#'fib* is a shorthand for (function fib), denoting
the fib function.

Application with apply:
    *apply* is similar to funcall but is used when you need to pass arguments as a list.

#+begin_src emacs-lisp
  (apply #'fib (list 30))
#+end_src

#+RESULTS:
: 832040

*** TODO Review values function
SCHEDULED: <2023-12-12 mar>

In Lisp, a function can return multiple *values* using the values function.
Since Emacs Lisp does not handle multiple return values in the same way as
Common Lisp, you would need to adjust the function accordingly. You could
return a list of values instead.

Example Adjusted for Emacs Lisp:

#+begin_src emacs-lisp
(defun many (n)
  (list n (* n 2) (* n 3)))

;; This will call 'many' with a single argument 10
(many 10)

#+end_src

#+RESULTS:
| 10 | 20 | 30 |

** Using an Anonymous Function:

    As an argument to another function:

#+begin_src emacs-lisp
    (mapcar (lambda (x) (* x x)) '(1 2 3 4 5))
#+end_src

#+RESULTS:
| 1 | 4 | 9 | 16 | 25 |


Here, mapcar is a function that applies the given function to each element
of the list. The anonymous function takes each element x and returns its
square.

** Immediately Invoked Anonymous Function:


#+begin_src emacs-lisp
(funcall (lambda (x) (* x x)) 10)
#+end_src

#+RESULTS:
: 100

Here, funcall is used to call the anonymous function immediately with the
argument 10, returning 100.

** Storing in a Variable:

    While you can't name a lambda function directly, you can assign it to a
    variable:

#+begin_src emacs-lisp
(setq square (lambda (x) (* x x)))
(funcall square 5)
#+end_src

#+RESULTS:
: 25

Here, square holds the anonymous function, and funcall is used to call it with
the argument 5.

Lambda functions are powerful tools in Lisp, allowing for more flexible and
concise code, especially when dealing with functional programming patterns like
mapping, filtering, and reducing collections.

* mapcar 
mapcar is a Lisp function. It's a higher-order function commonly used in Lisp
programming for list processing. The primary purpose of mapcar is to apply a
given function to each element of a list (or lists) and collect the results into
a new list.

Here's a brief overview of how mapcar works:

    Function: mapcar
    Purpose: To apply a function to each element of a list or lists.
    Syntax: (mapcar function list1 list2 ...)
    Parameters:
        function: A function that will be applied to the elements. This can be a
        named function or an anonymous function (lambda function). list1, list2,
        ...: One or more lists whose elements are passed as arguments to the
        function.

Example

If you have a function f and a list '(a b c), calling (mapcar f '(a b c)) will
apply f to each element of the list, resulting in a new list '(f(a) f(b) f(c)).

A simple example using a lambda function to square each number in a list:


#+begin_src emacs-lisp
(mapcar (lambda (x) (* x x)) '(1 2 3 4 5))
#+end_src

#+RESULTS:
| 1 | 4 | 9 | 16 | 25 |

mapcar is useful for a wide range of list processing tasks in Lisp, particularly
in functional programming scenarios where operations need to be applied
uniformly to collections of data. It's part of the standard Lisp language and is
available in various dialects of Lisp, including Common Lisp and Emacs Lisp.

